-- -*- M2-comint -*- {* hash: -1067040464 *}
<<<<<<< HEAD
--loading configuration for package "Bertini" from file /Users/jo/Library/Application Support/Macaulay2/init-Bertini.m2
=======
-- COMPILE TIME: Oct 14 2015, 14:51:21
--loading configuration for package "Bertini" from file /nethome/aleykin3/.Macaulay2/init-Bertini.m2
>>>>>>> Macaulay2/master

i1 : R = CC[x,y,z];

i2 : f = {(x^2+y^2-z^2)*(z-x),(x^2+y^2-z^2)*(z+y)};

i3 : bertiniPosDimSolve(f,ISPROJECTIVE=>1);
<<<<<<< HEAD
Temporary directory for input and output files:/var/folders/j_/gx42s4z576z_vj47_ym0j5xm0000gn/T/M2-28723-0/1
=======
Temporary directory for input and output files:/tmp/M2-29547-0/1
>>>>>>> Macaulay2/master

The version of Bertini 
	    you have installed on your computer 
	    was used for this run. 
Bertini is under ongoing development by 
	    D. Bates, J. Hauenstein, A. Sommese, and C. Wampler.


i4 : R=CC[x,y,z,u1,u2];--u1,u2 are parameters

i5 : f1=x^2+y^2-z^2;

i6 : f2=u1*x+u2*y;

i7 : finalParameters={{0,1}};

i8 : bPH=bertiniParameterHomotopy( {f1,f2}, {u1,u2},{finalParameters },ISPROJECTIVE=>1)
<<<<<<< HEAD
Temporary directory for input and output files:/var/folders/j_/gx42s4z576z_vj47_ym0j5xm0000gn/T/M2-28723-0/2
=======
Temporary directory for input and output files:/tmp/M2-29547-0/2
>>>>>>> Macaulay2/master

The version of Bertini 
	    you have installed on your computer 
	    was used for this run. 
Bertini is under ongoing development by 
	    D. Bates, J. Hauenstein, A. Sommese, and C. Wampler.


<<<<<<< HEAD
o8 = {{{-.602859+.091933*ii, 7.20994e-18+5.31259e-18*ii,
     ------------------------------------------------------------------------
     -.602859+.091933*ii}, {-.148382-.850475*ii, -1.3539e-17-5.41559e-17*ii,
     ------------------------------------------------------------------------
     .148382+.850475*ii}}}
=======
o8 = {{{-.677815+.038577*ii, -1.21973e-18-7.99599e-19*ii,
     ------------------------------------------------------------------------
     .677815-.038577*ii}, {-.052248+1.07253*ii, 3.33392e-18-1.09504e-17*ii,
     ------------------------------------------------------------------------
     -.052248+1.07253*ii}}}
>>>>>>> Macaulay2/master

o8 : List

i9 : 
