-- -*- M2-comint -*- {* hash: -1273063650 *}
--loading configuration for package "Bertini" from file /Users/jo/Library/Application Support/Macaulay2/init-Bertini.m2

i1 : makeB'InputFile(storeBM2Files,AffVariableGroup=>{x},B'Polynomials=>{"x^2-2"});

i2 : runBertini(storeBM2Files);
~/bertini

i3 : importSolutionsFile(storeBM2Files,NameSolutionsFile=>"nonsingular_solutions");

i4 : importSolutionsFile(storeBM2Files,NameSolutionsFile=>"real_finite_solutions");

i5 : writeStartFile(storeBM2Files,{{2},{ -2}},NameStartFile=>"start");

i6 : writeParameterFile(storeBM2Files,{4},NameParameterFile=>"start_parameters");

i7 : writeParameterFile(storeBM2Files,{3},NameParameterFile=>"final_parameters");

i8 : makeB'InputFile(storeBM2Files,B'Polynomials=>{"x^2-t"},ParameterGroup=>{t},B'Configs=>{{ParameterHomotopy,2}},AffVariableGroup=>{x},NameB'InputFile=>"inputWin");

i9 : runBertini(storeBM2Files,NameB'InputFile=>"inputWin");
~/bertini

i10 : importSolutionsFile(storeBM2Files,NameSolutionsFile=>"nonsingular_solutions")

o10 = {{1.73205}, {-1.73205}}

o10 : List

i11 : importSolutionsFile(storeBM2Files,NameSolutionsFile=>"real_finite_solutions")

o11 = {{1.73205}, {-1.73205}}

o11 : List

i12 : 
