-- -*- M2-comint -*- {* hash: -87661652 *}

i1 : s=bHyperplane({x,y,z})

o1 = BertiniHyperplane{...2...}

o1 : BertiniHyperplane

i2 : class s

o2 = BertiniHyperplane

o2 : Type

i3 : randomRealCoefficientGenerator=()->random(RR)

o3 = randomRealCoefficientGenerator

o3 : FunctionClosure

i4 : sReal=bHyperplane({x,y,z},RandomCoefficientGenerator=>randomRealCoefficientGenerator)

o4 = BertiniHyperplane{...2...}

o4 : BertiniHyperplane

i5 : sReal#BNumberCoefficients

o5 = {.0741835, .808694, .362835}

o5 : List

i6 : randomRationalCoefficientGenerator=()->random(QQ)

o6 = randomRationalCoefficientGenerator

o6 : FunctionClosure

i7 : sRational=bHyperplane({x,y,z},RandomCoefficientGenerator=>randomRationalCoefficientGenerator)

o7 = BertiniHyperplane{...2...}

o7 : BertiniHyperplane

i8 : sRational#BNumberCoefficients

       7  1   7
o8 = {--, -, --}
      10  2  10

o8 : List

i9 : affineSection=bHyperplane({x,y,z,1})

o9 = BertiniHyperplane{...2...}

o9 : BertiniHyperplane

i10 : X={x,y,z}

o10 = {x, y, z}

o10 : List

i11 : P={1,2,3}

o11 = {1, 2, 3}

o11 : List

i12 : affineContainingPoint=bHyperplane({x,y,z},ContainsPoint=>P)

o12 = BertiniHyperplane{...3...}

o12 : BertiniHyperplane

i13 : r= affineContainingPoint#B'SectionString

o13 = (1.18921+.849539*ii)*(x-(1)*(1))+(-.542371+.307137*ii)*(y-(1)*(2))+(
      1.36945+.015633*ii)*(z-(1)*(3))

i14 : print r
(1.18921+.849539*ii)*(x-(1)*(1))+(-.542371+.307137*ii)*(y-(1)*(2))+(1.36945+.015633*ii)*(z-(1)*(3))

i15 : rHomogeSection= bHyperplane({x,y,z},ContainsPoint=>P,B'Homogenization=>"x+y+z")

o15 = BertiniHyperplane{...3...}

o15 : BertiniHyperplane

i16 : peek rHomogeSection

o16 = BertiniHyperplane{BHomogenization => x+y+z                           
                        BHyperplaneString => (.534614-.175945*ii)*(x-(x+y+z
                        BNumberCoefficients => {.534614-.175945*ii, .426704
      -----------------------------------------------------------------------
                                                                             
      )*(1))+(.426704-.97539*ii)*(y-(x+y+z)*(2))+(-.478803+.0416008*ii)*(z-(x
      -.97539*ii, -.478803+.0416008*ii}
      -----------------------------------------------------------------------
                }
      +y+z)*(3))

i17 : print rHomogeSection#B'SectionString
(.534614-.175945*ii)*(x-(x+y+z)*(1))+(.426704-.97539*ii)*(y-(x+y+z)*(2))+(-.478803+.0416008*ii)*(z-(x+y+z)*(3))

i18 : f="y^3-x*y+1"

o18 = y^3-x*y+1

i19 : s1=bHyperplane({x,y,1})

o19 = BertiniHyperplane{...2...}

o19 : BertiniHyperplane

i20 : bWriteInputFile(storeBM2Files,
        AffVariableGroup=>{x,y},
        B'Polynomials=>{f,s1})

o20 = /var/folders/46/9b86vqxj4hjcngvy7kd7sb140000gn/T/M2-26075-0/0/input

o20 : File

i21 : runBertini(storeBM2Files)

i22 : #importSolutionsFile(storeBM2Files)==3

o22 = true

i23 : 
