-- -*- M2-comint -*- {* hash: -821716398 *}
--loading configuration for package "Bertini" from file /Users/jo/Library/Application Support/Macaulay2/init-Bertini.m2

i1 : f="x^3+x*y^2+y+y^3+x-2";     h="a1*x+a2*y-1";

i3 : writeStartFile(storeBM2Files,{{1,0}},NameStartFile=>"startSave");

i4 : writeParameterFile(storeBM2Files,{1,0},NameParameterFile=>"start_parameters");

i5 : makeB'InputFile(storeBM2Files,
         B'Configs=>{{PARAMETERHOMOTOPY,2},{MPTYPE,2}},AffVariableGroup=>{x,y},ParameterGroup=>{a1,a2}, B'Polynomials=>{f,h}    )

o5 = /var/folders/j_/gx42s4z576z_vj47_ym0j5xm0000gn/T/M2-74671-0/0/input

o5 : File

i6 : b'PHMonodromyCollect(storeBM2Files,
         NameStartFile=>"startSave",
         NameSolutionsFile=>"simple_raw_solutions",
         NumberOfLoops=>10,NumSolBound=>3,
         MonodromyStartParameters=>{1,0}        )
/var/folders/j_/gx42s4z576z_vj47_ym0j5xm0000gn/T/M2-74671-0/0/
(Monodromy loop number, 1)
~/bertini
~/bertini
~/bertini
(Monodromy loop number, 2)
~/bertini
~/bertini
~/bertini
(Monodromy loop number, 3)
~/bertini
~/bertini
~/bertini
(Monodromy loop number, 4)
~/bertini
~/bertini
~/bertini
(Monodromy loop number, 5)
~/bertini
~/bertini
~/bertini
3

o6 = {{1, -.5-.866025*ii}, {1, -.5+.866025*ii}, {1,
     ------------------------------------------------------------------------
     -8.6739e-17-9.48317e-16*ii}}

o6 : List

i7 : f="x^3+x*y^2+y+y^3+x-2";     h="a1*x+a2*y-1";

i9 : makeB'InputFile(storeBM2Files,
         B'Configs=>{{PARAMETERHOMOTOPY,2},{MPTYPE,2}},AffVariableGroup=>{x,y},ParameterGroup=>{a1,a2}, B'Polynomials=>{f,h}    )

o9 = /var/folders/j_/gx42s4z576z_vj47_ym0j5xm0000gn/T/M2-74671-0/0/input

o9 : File

i10 : b'PHMonodromyCollect(storeBM2Files,
          StorageFolder=>"StoreFiles",
          MonodromyStartPoints=>{{1,0}},
          NumberOfLoops=>10,NumSolBound=>3,
          MonodromyStartParameters=>{1,0}        )
/var/folders/j_/gx42s4z576z_vj47_ym0j5xm0000gn/T/M2-74671-0/0/
(Monodromy loop number, 1)
~/bertini
~/bertini
~/bertini
(Monodromy loop number, 2)
~/bertini
~/bertini
~/bertini
(Monodromy loop number, 3)
~/bertini
~/bertini
~/bertini
3

o10 = {{1, -.5-.866025*ii}, {1, -.5+.866025*ii}, {1,
      -----------------------------------------------------------------------
      7.11849e-16-3.45223e-16*ii}}

o10 : List

i11 : 
