-- -*- M2-comint -*- {* hash: -644878192 *}
--loading configuration for package "Bertini" from file /Users/jo/Library/Application Support/Macaulay2/init-Bertini.m2

i1 : R=CC[x0,x1,x2]

o1 = R

o1 : PolynomialRing

i2 : F={x0^3-x1^3+x2^3+1}

        3     3     3
o2 = {x0  - x1  + x2  + 1}

o2 : List

i3 : sliceH=makeB'Slice({2},{{x0,x1,x2,1}},NameB'Slice=>"H")
2
{{}, {}}

o3 = B'Slice{...4...}

o3 : B'Slice

i4 : makeB'InputFile(storeBM2Files,
         AffVariableGroup=>{x0,x1,x2},
         ParameterGroup=>{T},
         B'Configs=>{{ParameterHomotopy,1}},
         B'Functions=>{sliceH},
         B'Polynomials=>{"H0+T","H1"}|F)

o4 = /var/folders/j_/gx42s4z576z_vj47_ym0j5xm0000gn/T/M2-74600-0/0/input

o4 : File

i5 : runBertini(storeBM2Files,PreparePH2=>true)
~/bertini

i6 : b'TraceTestImage(storeBM2Files)
~/bertini
~/bertini

o6 = {1.11022e-16+1.11022e-16*ii, -8.88178e-16-1.11022e-15*ii,
     ------------------------------------------------------------------------
     -8.88178e-16-1.55431e-15*ii}

o6 : List

i7 : R=CC[x,y,z]**CC[a,b]

o7 = R

o7 : PolynomialRing

i8 : xyzSub={{x,a},{y,a^2+b},{z,a^2+b^2}}

                   2            2    2
o8 = {{x, a}, {y, a  + b}, {z, a  + b }}

o8 : List

i9 : sliceH=makeB'Slice({2},{{x,y,z,1}},NameB'Slice=>"H")
2
{{}, {}}

o9 = B'Slice{...4...}

o9 : B'Slice

i10 : makeB'InputFile(storeBM2Files,
          AffVariableGroup=>{a,b},
          ParameterGroup=>{T},
          B'Configs=>{{ParameterHomotopy,1}},
          B'Functions=>xyzSub|{sliceH},
          B'Polynomials=>{"H1","H0+T"})

o10 = /var/folders/j_/gx42s4z576z_vj47_ym0j5xm0000gn/T/M2-74600-0/0/input

o10 : File

i11 : runBertini(storeBM2Files,PreparePH2=>true)
~/bertini

i12 : s=importSolutionsFile(storeBM2Files)

o12 = {{-.562602+3.24657*ii, 4.05316+.575333*ii}, {-.223317+1.21526*ii,
      -----------------------------------------------------------------------
      -1.97609-.300483*ii}, {-.159001-.844238*ii, .327621+.733062*ii},
      -----------------------------------------------------------------------
      {-.752626-.609256*ii, -.40469-1.00791*ii}}

o12 : List

i13 : b'TraceTestImage(storeBM2Files,MapPoints=>({a,a^2+b,a^2+b^2},{a,b}))
~/bertini
~/bertini

o13 = {- 8.88178e-16 + 4.88498e-15*ii, - 1.42109e-14 - 1.06581e-14*ii, -
      -----------------------------------------------------------------------
      1.15463e-14 - 1.5099e-14*ii}

o13 : List

i14 : R=CC[x0,x1,x2]

o14 = R

o14 : PolynomialRing

i15 : F={x0^3-x1^3+x2^3+1}

         3     3     3
o15 = {x0  - x1  + x2  + 1}

o15 : List

i16 : sliceH=makeB'Slice(2,{x0,x1,x2,1},NameB'Slice=>"H")
2
{{}, {}}

o16 = B'Slice{...4...}

o16 : B'Slice

i17 : makeB'InputFile(storeBM2Files,
          AffVariableGroup=>{x0,x1,x2},
          ParameterGroup=>{T},
          B'Configs=>{{ParameterHomotopy,1}},
          B'Functions=>{sliceH},
          B'Polynomials=>{"H0+T","H1"}|F)

o17 = /var/folders/j_/gx42s4z576z_vj47_ym0j5xm0000gn/T/M2-74600-0/0/input

o17 : File

i18 : runBertini(storeBM2Files,PreparePH2=>true)
~/bertini

i19 : b'TraceTestImage(storeBM2Files,StopBeforeTest=>true)--Returns the trace for each parameter homotopy using -gammma, 0, and gamma respectively.
~/bertini
~/bertini

o19 = {{-.259475-.866203*ii, .481912+.264561*ii, -2.07986+.87759*ii},
      -----------------------------------------------------------------------
      {-.618906-1.16602*ii, .520256+.160256*ii, -1.94863+1.25627*ii},
      -----------------------------------------------------------------------
      {-.978337-1.46584*ii, .558601+.055951*ii, -1.81739+1.63495*ii}}

o19 : List

i20 : 
