-- -*- M2-comint -*- {* hash: -644878192 *}
--loading configuration for package "Bertini" from file /Users/dan/Library/Application Support/Macaulay2/init-Bertini.m2

i1 : R=CC[x0,x1,x2]

o1 = R

o1 : PolynomialRing

i2 : F={x0^3-x1^3+x2^3+1}

        3     3     3
o2 = {x0  - x1  + x2  + 1}

o2 : List

i3 : sliceH=makeB'Slice({2},{{x0,x1,x2,1}},NameB'Slice=>"H")
2
{{}, {}}

o3 = B'Slice{...4...}

o3 : B'Slice

i4 : makeB'InputFile(storeBM2Files,
         AffVariableGroup=>{x0,x1,x2},
         ParameterGroup=>{T},
         B'Configs=>{{ParameterHomotopy,1}},
         B'Functions=>{sliceH},
         B'Polynomials=>{"H0+T","H1"}|F)

o4 = /var/folders/46/9b86vqxj4hjcngvy7kd7sb140000gn/T/M2-22737-0/0/input

o4 : File

i5 : runBertini(storeBM2Files,PreparePH2=>true)
bertini

i6 : b'TraceTestImage(storeBM2Files)
bertini
bertini

o6 = {-2.22045e-16, 1.33227e-15+8.88178e-16*ii, 2.22045e-16*ii}

o6 : List

i7 : R=CC[x,y,z]**CC[a,b]

o7 = R

o7 : PolynomialRing

i8 : xyzSub={{x,a},{y,a^2+b},{z,a^2+b^2}}

                   2            2    2
o8 = {{x, a}, {y, a  + b}, {z, a  + b }}

o8 : List

i9 : sliceH=makeB'Slice({2},{{x,y,z,1}},NameB'Slice=>"H")
2
{{}, {}}

o9 = B'Slice{...4...}

o9 : B'Slice

i10 : makeB'InputFile(storeBM2Files,
          AffVariableGroup=>{a,b},
          ParameterGroup=>{T},
          B'Configs=>{{ParameterHomotopy,1}},
          B'Functions=>xyzSub|{sliceH},
          B'Polynomials=>{"H1","H0+T"})

o10 = /var/folders/46/9b86vqxj4hjcngvy7kd7sb140000gn/T/M2-22737-0/0/input

o10 : File

i11 : runBertini(storeBM2Files,PreparePH2=>true)
bertini

i12 : s=importSolutionsFile(storeBM2Files)

o12 = {{-.754356-.423415*ii, -.492855-1.17821*ii}, {.027381-.750045*ii,
      -----------------------------------------------------------------------
      .286528+.954772*ii}, {-.652062+3.14353*ii, 3.90141+.686495*ii},
      -----------------------------------------------------------------------
      {-.318508+1.03827*ii, -1.69508-.463055*ii}}

o12 : List

i13 : b'TraceTestImage(storeBM2Files,MapPoints=>({a,a^2+b,a^2+b^2},{a,b}))
bertini
bertini

o13 = {8.88178e-16, - 8.88178e-16 - 3.55271e-15*ii, - 1.68754e-14 -
      -----------------------------------------------------------------------
      2.13163e-14*ii}

o13 : List

i14 : R=CC[x0,x1,x2]

o14 = R

o14 : PolynomialRing

i15 : F={x0^3-x1^3+x2^3+1}

         3     3     3
o15 = {x0  - x1  + x2  + 1}

o15 : List

i16 : sliceH=makeB'Slice(2,{x0,x1,x2,1},NameB'Slice=>"H")
2
{{}, {}}

o16 = B'Slice{...4...}

o16 : B'Slice

i17 : makeB'InputFile(storeBM2Files,
          AffVariableGroup=>{x0,x1,x2},
          ParameterGroup=>{T},
          B'Configs=>{{ParameterHomotopy,1}},
          B'Functions=>{sliceH},
          B'Polynomials=>{"H0+T","H1"}|F)

o17 = /var/folders/46/9b86vqxj4hjcngvy7kd7sb140000gn/T/M2-22737-0/0/input

o17 : File

i18 : runBertini(storeBM2Files,PreparePH2=>true)
bertini

i19 : b'TraceTestImage(storeBM2Files,StopBeforeTest=>true)--Returns the trace for each parameter homotopy using -gammma, 0, and gamma respectively.
bertini
bertini

o19 = {{.394888-.926156*ii, .547558+.406091*ii, -2.58635+.632553*ii},
      -----------------------------------------------------------------------
      {.035457-1.22597*ii, .585902+.301786*ii, -2.45511+1.01123*ii},
      -----------------------------------------------------------------------
      {-.323974-1.52579*ii, .624247+.197481*ii, -2.32387+1.38991*ii}}

o19 : List

i20 : 
