-- -*- M2-comint -*- {* hash: 990989090 *}

i1 : R=QQ[x,y]

o1 = R

o1 : PolynomialRing

i2 : makeB'InputFile(storeBM2Files,
         AffVariableGroup=>{{x,y}},
         B'Polynomials=>{x^2-1,y^2-4})

o2 = /var/folders/46/9b86vqxj4hjcngvy7kd7sb140000gn/T/M2-98097-0/0/input

o2 : File

i3 : runBertini(storeBM2Files)
bertini

i4 : R=QQ[x,y]

o4 = R

o4 : PolynomialRing

i5 : theDir1 = temporaryFileName()

o5 = /var/folders/46/9b86vqxj4hjcngvy7kd7sb140000gn/T/M2-98097-0/1

i6 : makeDirectory theDir1

i7 : theDir2 = temporaryFileName()

o7 = /var/folders/46/9b86vqxj4hjcngvy7kd7sb140000gn/T/M2-98097-0/2

i8 : makeDirectory theDir2

i9 : makeB'InputFile(theDir1,
         AffVariableGroup=>{{x,y}},
         B'Polynomials=>{x^2-1,y^2-4})

o9 = /var/folders/46/9b86vqxj4hjcngvy7kd7sb140000gn/T/M2-98097-0/1/input

o9 : File

i10 : runBertini(theDir2,InputFileDirectory=>theDir1)
bertini

i11 : 
