-- -*- M2-comint -*- {* hash: -1270144364 *}
--loading configuration for package "Bertini" from file /Users/jo/Library/Application Support/Macaulay2/init-Bertini.m2

i1 : F={"x*(x+2*y+3*z^2)","(y^3-x+z)*(z)*(x+2*y+3*z^2)"}

o1 = {x*(x+2*y+3*z^2), (y^3-x+z)*(z)*(x+2*y+3*z^2)}

o1 : List

i2 : makeB'InputFile(storeBM2Files,B'Configs=>{{TrackType,1}},AffVariableGroup=>{x,y,z},B'Polynomials=>F)

o2 = /var/folders/j_/gx42s4z576z_vj47_ym0j5xm0000gn/T/M2-74797-0/0/input

o2 : File

i3 : runBertini(storeBM2Files)
~/bertini

i4 : listPoints=importMainDataFile(storeBM2Files)

o4 = {{.0629902+.186767*ii, -.230288-1.24962*ii, .676262+.569914*ii},
     ------------------------------------------------------------------------
     {-.657772-.99514*ii, -.579896+.113665*ii, -.794843-.160998*ii},
     ------------------------------------------------------------------------
     {7.59177e-18-3.11078e-18*ii, -.193723-.0570773*ii,
     ------------------------------------------------------------------------
     5.17721e-17-3.48112e-18*ii}, {4.22431e-17-4.92037e-18*ii,
     ------------------------------------------------------------------------
     -.639405+.340271*ii, .0393148-.377949*ii}, {2.7019e-18+1.10019e-18*ii,
     ------------------------------------------------------------------------
     -.190816-.0699427*ii, .00414731+.0072978*ii},
     ------------------------------------------------------------------------
     {-1.99469e-17-9.42307e-18*ii, .830221-.270328*ii, -.390232+.539229*ii}}

o4 : List

i5 : #listPoints

o5 = 6

i6 : theComponents=sortMainDataComponents(listPoints)

o6 = {{{.0629902+.186767*ii, -.230288-1.24962*ii, .676262+.569914*ii},
     ------------------------------------------------------------------------
     {-.657772-.99514*ii, -.579896+.113665*ii, -.794843-.160998*ii}},
     ------------------------------------------------------------------------
     {{7.59177e-18-3.11078e-18*ii, -.193723-.0570773*ii,
     ------------------------------------------------------------------------
     5.17721e-17-3.48112e-18*ii}}, {{4.22431e-17-4.92037e-18*ii,
     ------------------------------------------------------------------------
     -.639405+.340271*ii, .0393148-.377949*ii}, {2.7019e-18+1.10019e-18*ii,
     ------------------------------------------------------------------------
     -.190816-.0699427*ii, .00414731+.0072978*ii},
     ------------------------------------------------------------------------
     {-1.99469e-17-9.42307e-18*ii, .830221-.270328*ii, -.390232+.539229*ii}}}

o6 : List

i7 : for i in theComponents_0 list (i#ComponentNumber,i#Dimension)

o7 = {(0, 2), (0, 2)}

o7 : List

i8 : for i in theComponents_1 list (i#ComponentNumber,i#Dimension)

o8 = {(0, 1)}

o8 : List

i9 : for i in theComponents_2 list (i#ComponentNumber,i#Dimension)

o9 = {(1, 1), (1, 1), (1, 1)}

o9 : List

i10 : 
