-- -*- M2-comint -*- {* hash: -1270144364 *}
--loading configuration for package "Bertini" from file /Users/dan/Library/Application Support/Macaulay2/init-Bertini.m2

i1 : F={"x*(x+2*y+3*z^2)","(y^3-x+z)*(z)*(x+2*y+3*z^2)"}

o1 = {x*(x+2*y+3*z^2), (y^3-x+z)*(z)*(x+2*y+3*z^2)}

o1 : List

i2 : makeB'InputFile(storeBM2Files,B'Configs=>{{TrackType,1}},AffVariableGroup=>{x,y,z},B'Polynomials=>F)

o2 = /var/folders/46/9b86vqxj4hjcngvy7kd7sb140000gn/T/M2-22824-0/0/input

o2 : File

i3 : runBertini(storeBM2Files)
bertini

i4 : listPoints=importMainDataFile(storeBM2Files)

o4 = {{-.146723-.248387*ii, .309819+.907208*ii, .440258-.592845*ii},
     ------------------------------------------------------------------------
     {.378706+.953609*ii, -.175523-.0695429*ii, -.362246+.374756*ii},
     ------------------------------------------------------------------------
     {1.01066e-17-2.79608e-17*ii, -.528587+.435355*ii,
     ------------------------------------------------------------------------
     -5.59215e-17-2.02132e-17*ii}, {-1.76031e-17+2.65767e-17*ii,
     ------------------------------------------------------------------------
     -.385898+.304106*ii, -.049597-.107736*ii}, {2.90686e-17-5.16084e-17*ii,
     ------------------------------------------------------------------------
     -.337219-.867125*ii, -.722324-.356177*ii}, {-1.68892e-17-6.17453e-17*ii,
     ------------------------------------------------------------------------
     .723117+.56302*ii, .309548-.704734*ii}}

o4 : List

i5 : #listPoints

o5 = 6

i6 : theComponents=sortMainDataComponents(listPoints)

o6 = {{{-.146723-.248387*ii, .309819+.907208*ii, .440258-.592845*ii},
     ------------------------------------------------------------------------
     {.378706+.953609*ii, -.175523-.0695429*ii, -.362246+.374756*ii}},
     ------------------------------------------------------------------------
     {{1.01066e-17-2.79608e-17*ii, -.528587+.435355*ii,
     ------------------------------------------------------------------------
     -5.59215e-17-2.02132e-17*ii}}, {{-1.76031e-17+2.65767e-17*ii,
     ------------------------------------------------------------------------
     -.385898+.304106*ii, -.049597-.107736*ii}, {2.90686e-17-5.16084e-17*ii,
     ------------------------------------------------------------------------
     -.337219-.867125*ii, -.722324-.356177*ii}, {-1.68892e-17-6.17453e-17*ii,
     ------------------------------------------------------------------------
     .723117+.56302*ii, .309548-.704734*ii}}}

o6 : List

i7 : for i in theComponents_0 list (i#ComponentNumber,i#Dimension)

o7 = {(0, 2), (0, 2)}

o7 : List

i8 : for i in theComponents_1 list (i#ComponentNumber,i#Dimension)

o8 = {(0, 1)}

o8 : List

i9 : for i in theComponents_2 list (i#ComponentNumber,i#Dimension)

o9 = {(1, 1), (1, 1), (1, 1)}

o9 : List

i10 : 
