-- -*- M2-comint -*- hash: 1569677465
****************************************************************************
CoincidentRootLoci v.0.1.2 loaded successfully (last updated: June 22, 2020)
****************************************************************************

i1 : time D77 = realRankBoundary(7,7)
     -- used 0.50038 seconds

o1 = CRL(2,1,1,1,1,1)

o1 : CoincidentRootLocus

i2 : describe D77

o2 = Coincident root locus associated with the partition {2, 1, 1, 1, 1, 1} defined over QQ
     ambient: P^7 = Proj(QQ[t_0, t_1, t_2, t_3, t_4, t_5, t_6, t_7])
     dim    = 6
     codim  = 1
     degree = 12
     The singular locus is the union of the coincident root loci associated with the partitions: 
     ({2, 2, 1, 1, 1},{3, 1, 1, 1, 1})
     The defining polynomial has 1103 terms of degree 12

i3 : time D64 = realRankBoundary(6,4)
     -- used 2.76743 seconds

o3 = {CRL(5,1) * CRL(5,1) (dual of CRL(3,3)), CRL(4,1,1) * CRL(6) (dual of
     ------------------------------------------------------------------------
     CRL(4,2))}

o3 : List

i4 : describe first D64

o4 = Dual of the coincident root locus associated with the partition {3, 3} defined over QQ
     which coincides with the join of the coincident root loci associated with the partitions: ({5, 1},{5, 1})
     ambient: P^6 = Proj(QQ[t_0, t_1, t_2, t_3, t_4, t_5, t_6])
     dim    = 5
     codim  = 1
     degree = 12
     The defining polynomial has 560 terms of degree 12

i5 : describe last D64

o5 = Dual of the coincident root locus associated with the partition {4, 2} defined over QQ
     which coincides with the join of the coincident root loci associated with the partitions: ({4, 1, 1},{6})
     ambient: P^6 = Proj(QQ[t_0, t_1, t_2, t_3, t_4, t_5, t_6])
     dim    = 5
     codim  = 1
     degree = 18
     The defining polynomial has 3140 terms of degree 18

i6 : time D74 = realRankBoundary(7,4)
     -- used 0.444119 seconds

o6 = CRL(6,1) * CRL(7) * CRL(7) (dual of CRL(3,2,2))

o6 : JoinOfCoincidentRootLoci

i7 : describe D74

o7 = Dual of the coincident root locus associated with the partition {3, 2, 2} defined over QQ
     which coincides with the join of the coincident root loci associated with the partitions:
     ({6, 1},{7},{7})
     ambient: P^7 = Proj(QQ[t_0, t_1, t_2, t_3, t_4, t_5, t_6, t_7])
     dim    = 6
     codim  = 1
     degree = 24

i8 : time D75 = realRankBoundary(7,5)
     -- used 0.229553 seconds

o8 = {CRL(6,1) * CRL(7) * CRL(7) (dual of CRL(3,2,2)), CRL(5,1,1) * CRL(6,1)
     ------------------------------------------------------------------------
     (dual of CRL(4,3)), CRL(4,1,1,1) * CRL(7) (dual of CRL(5,2))}

o8 : List

i9 : describe D75_0

o9 = Dual of the coincident root locus associated with the partition {3, 2, 2} defined over QQ
     which coincides with the join of the coincident root loci associated with the partitions:
     ({6, 1},{7},{7})
     ambient: P^7 = Proj(QQ[t_0, t_1, t_2, t_3, t_4, t_5, t_6, t_7])
     dim    = 6
     codim  = 1
     degree = 24

i10 : describe D75_1

o10 = Dual of the coincident root locus associated with the partition {4, 3} defined over QQ
      which coincides with the join of the coincident root loci associated with the partitions: ({5, 1, 1},{6, 1})
      ambient: P^7 = Proj(QQ[t_0, t_1, t_2, t_3, t_4, t_5, t_6, t_7])
      dim    = 6
      codim  = 1
      degree = 36

i11 : describe D75_2

o11 = Dual of the coincident root locus associated with the partition {5, 2} defined over QQ
      which coincides with the join of the coincident root loci associated with the partitions: ({4, 1, 1, 1},{7})
      ambient: P^7 = Proj(QQ[t_0, t_1, t_2, t_3, t_4, t_5, t_6, t_7])
      dim    = 6
      codim  = 1
      degree = 24

i12 : time D76 = realRankBoundary(7,6)
     -- used 0.000298063 seconds

o12 = {CRL(5,1,1) * CRL(6,1) (dual of CRL(4,3)), CRL(4,1,1,1) * CRL(7) (dual
      -----------------------------------------------------------------------
      of CRL(5,2)), CRL(2,1,1,1,1,1)}

o12 : List

i13 : describe D76_0

o13 = Dual of the coincident root locus associated with the partition {4, 3} defined over QQ
      which coincides with the join of the coincident root loci associated with the partitions: ({5, 1, 1},{6, 1})
      ambient: P^7 = Proj(QQ[t_0, t_1, t_2, t_3, t_4, t_5, t_6, t_7])
      dim    = 6
      codim  = 1
      degree = 36

i14 : describe D76_1

o14 = Dual of the coincident root locus associated with the partition {5, 2} defined over QQ
      which coincides with the join of the coincident root loci associated with the partitions: ({4, 1, 1, 1},{7})
      ambient: P^7 = Proj(QQ[t_0, t_1, t_2, t_3, t_4, t_5, t_6, t_7])
      dim    = 6
      codim  = 1
      degree = 24

i15 : describe D76_2

o15 = Coincident root locus associated with the partition {2, 1, 1, 1, 1, 1} defined over QQ
      ambient: P^7 = Proj(QQ[t_0, t_1, t_2, t_3, t_4, t_5, t_6, t_7])
      dim    = 6
      codim  = 1
      degree = 12
      The singular locus is the union of the coincident root loci associated with the partitions: 
      ({2, 2, 1, 1, 1},{3, 1, 1, 1, 1})
      The defining polynomial has 1103 terms of degree 12

i16 : 
