-- -*- M2-comint -*- {* hash: -1285962778 *}
-- COMPILE TIME: Oct  7 2016, 07:56:28
--loading configuration for package "PHCpack" from file /Users/leykin/Library/Application Support/Macaulay2/init-PHCpack.m2

i1 : R = CC[x,y,z];

i2 : f = { x^2 - y, x^3 - z };

i3 : fe1 = constructEmbedding(f,1);

i4 : toString fe1

o4 = {x^2-y+(-.810346-.585952*ii)*zz1, x^3-z+(.614234+.789124*ii)*zz1, zz1,
     (-.693091+.72085*ii)*x+(.748125+.663558*ii)*y+(.449879-.893089*ii)*z
     +(-.946093+.323896*ii)*zz1-.913445+.406963*ii}

i5 : R = CC[x,y,z];

i6 : f = { x^2-y, x^3-z, x*y-z, x*z-y^2 };

i7 : fe1 = constructEmbedding(f,1);

i8 : toString fe1

o8 = {x^2-y+(-.0966877-.995315*ii)*ss1+(-.508099-.861299*ii)*zz1,
     x^3-z+(.226341+.974048*ii)*ss1+(-.868161-.496283*ii)*zz1,
     x*y-z+(.996174+.0873973*ii)*ss1+(-.748753-.662849*ii)*zz1,
     -y^2+x*z+(.879154+.476538*ii)*ss1+(.254913-.966964*ii)*zz1,
     (.995481-.0949657*ii)*x+(-.840023-.542551*ii)*y+(-.996317+.0857457*ii)*z
     +(.614318-.789059*ii)*ss1+(.0906107-.995886*ii)*zz1-.122412-.992479*ii}

i9 : 
