-- -*- M2-comint -*- {* hash: 1509569113 *}
-- COMPILE TIME: Oct  7 2016, 07:56:28
--loading configuration for package "PHCpack" from file /Users/leykin/Library/Application Support/Macaulay2/init-PHCpack.m2

i1 : R=CC[a,b,c,d];

i2 : M=matrix for i to 2 list for j to 3 list random(1,R)+random(0,R);
-- warning: experimental computation over inexact field begun
--          results not reliable (one warning given per session)

             3       4
o2 : Matrix R  <--- R

i3 : I=minors(3,M);

o3 : Ideal of R

i4 : f=flatten entries gens I;

i5 : (w,ns) = topWitnessSet(f,2);
*** variables in the ring : {a, b, c, d, zz1, zz2} ***

i6 : slcmat = matrix applyTable (entries w.Slice, x->1_CC*realPart x);

                2          7
o6 : Matrix CC    <--- CC
              53         53

i7 : Rtwo = ring w.Equations;

i8 : X = transpose matrix {gens Rtwo | {1_CC}};

                7          1
o8 : Matrix Rtwo  <--- Rtwo

i9 : slcRR = flatten entries (promote(slcmat,Rtwo) * X);

i10 : fsols = intersectSlice(w,slcRR)

o10 = {{1.40406-.273197*ii, 1.85935-.233734*ii, -1.54647+.457338*ii,
      -----------------------------------------------------------------------
      1.13781-.347113*ii, 5.1446e-15+6.51162e-14*ii,
      -----------------------------------------------------------------------
      -7.19684e-15+5.5108e-14*ii}, {-4.41658+5.54784*ii, -1.34961+.991832*ii,
      -----------------------------------------------------------------------
      4.92592-2.35104*ii, -.839952-4.43769*ii, 5.20926e-13-3.91506e-13*ii,
      -----------------------------------------------------------------------
      -4.12899e-13+5.34275e-13*ii}, {.99884-3.40472*ii, -.485574-1.42614*ii,
      -----------------------------------------------------------------------
      2.82336+2.95296*ii, -5.49028+.222586*ii, 5.91162e-13-1.50415e-13*ii,
      -----------------------------------------------------------------------
      -5.71879e-13-1.09968e-13*ii}, {1.13014+.051366*ii, 1.23215+.104164*ii,
      -----------------------------------------------------------------------
      -.362187-.197232*ii, -.412066+.249488*ii, 7.78428e-15-5.55341e-15*ii,
      -----------------------------------------------------------------------
      -3.97492e-15-9.34601e-15*ii}, {-2.38878-.549847*ii,
      -----------------------------------------------------------------------
      -.132327+.197693*ii, 2.48754-.313798*ii, .152985+1.34536*ii,
      -----------------------------------------------------------------------
      -3.54138e-14+8.7868e-16*ii, 1.63793e-14-2.22391e-14*ii},
      -----------------------------------------------------------------------
      {1.13528+2.30361*ii, 1.78765+1.08373*ii, -1.38888-2.21745*ii,
      -----------------------------------------------------------------------
      1.28046+.21289*ii, -1.06418e-14+4.07613e-14*ii,
      -----------------------------------------------------------------------
      2.30399e-14-4.07039e-14*ii}}

o10 : List

i11 : 
