-- -*- M2-comint -*- {* hash: -1229619679 *}
-- COMPILE TIME: Oct  7 2016, 07:56:28
--loading configuration for package "PHCpack" from file /Users/leykin/Library/Application Support/Macaulay2/init-PHCpack.m2

i1 : R = CC[x,y];

i2 : f = { x^3*y^5 + y^2 + x^2*y, x*y + x^2 - 1};

i3 : I=ideal f;

o3 : Ideal of R

i4 : dim I
-- warning: experimental computation over inexact field begun
--          results not reliable (one warning given per session)

o4 = 0

i5 : degree I

o5 = 10

i6 : m = mixedVolume(f) -- counts the number of complex roots in the torus (without zero components)

o6 = 8

i7 : (mv,sv) = mixedVolume(f,StableMixedVolume=>true)

o7 = (8, 10)

o7 : Sequence

i8 : (mv,q,qsols) = mixedVolume(f,StartSystem=>true);

i9 : q --let's take a look at the start system:

                               3 5                          2                
o9 = {(- .717228 + .696838*ii)x y  + (.350981 + .936383*ii)x y + (- .988162 +
     ------------------------------------------------------------------------
                 2                            2
     .153413*ii)y , (- .999372 - .0354238*ii)x  + (- .160655 + .987011*ii)x*y
     ------------------------------------------------------------------------
     - .637136 + .770752*ii}

o9 : List

i10 : qsols --and its solutions:

o10 = {{.480894+.638003*ii, -.58249-.075012*ii}, {-.177919+.525739*ii,
      -----------------------------------------------------------------------
      .1805+1.87516*ii}, {-.081049-.980669*ii, -.378984-.628299*ii},
      -----------------------------------------------------------------------
      {.259421+1.45254*ii, .96867+.075864*ii}, {-.950267-.699585*ii,
      -----------------------------------------------------------------------
      .268065+.941628*ii}, {-.617371-1.3905*ii, -.768344+.403321*ii},
      -----------------------------------------------------------------------
      {.078101-.559451*ii, .109387-1.64411*ii}, {1.00819+1.01392*ii,
      -----------------------------------------------------------------------
      .203195-.948557*ii}}

o10 : List

i11 : 
