-- -*- M2-comint -*- {* hash: -2024144972 *}
-- COMPILE TIME: Oct  7 2016, 07:56:28
--loading configuration for package "PHCpack" from file /Users/leykin/Library/Application Support/Macaulay2/init-PHCpack.m2

i1 : R = CC[x,y];

i2 : f = { x^3*y^5 + y^2 + x^2*y, x*y + x^2 - 1};

i3 : fSols = solveSystem(f, randomSeed=>3);
*** variables in the ring : {x, y} ***

i4 : fSols/print
{-1, 0}
{1, 0}
{-.894935+.624334*ii, .143333-1.14868*ii}
{-.764107, -.544612}
{.742585+.425943*ii, .270685-1.00715*ii}
{-.894935-.624334*ii, .143333+1.14868*ii}
{1.33076-.335184*ii, -.62414+.513163*ii}
{.742585-.425943*ii, .270685+1.00715*ii}
{-1.59272, .964857}
{1.33076+.335184*ii, -.62414-.513163*ii}

o4 = {, , , , , , , , , }

o4 : List

i5 : nonZeroSols = nonZeroFilter(fSols,1,1.0e-10);

i6 : nonZeroSols / print
{-.894935+.624334*ii, .143333-1.14868*ii}
{-.764107, -.544612}
{.742585+.425943*ii, .270685-1.00715*ii}
{-.894935-.624334*ii, .143333+1.14868*ii}
{1.33076-.335184*ii, -.62414+.513163*ii}
{.742585-.425943*ii, .270685+1.00715*ii}
{-1.59272, .964857}
{1.33076+.335184*ii, -.62414-.513163*ii}

o6 = {, , , , , , , }

o6 : List

i7 : f = {x^2+y^2,y*x+x};

i8 : fSols = solveSystem(f);
*** variables in the ring : {x, y} ***

i9 : fSols/print
(-2.6963e-33+6.54816e-33*ii, 1.82998e-32-4.76315e-33*ii)
{-ii, -1}
{ii, -1}

o9 = {, , }

o9 : List

i10 : zeroSols = zeroFilter(fSols,0,1.0e-10);

i11 : zeroSols/print
(-2.6963e-33+6.54816e-33*ii, 1.82998e-32-4.76315e-33*ii)

o11 = {}

o11 : List

i12 : 
